{"modelTopology": {"node": [{"name": "/input", "op": "Placeholder", "input": "input", "category": "input", "output": ["output"]}], "format": "layers-model", "generatedBy": "TensorFlow.js tfjs-layers v4.20.0"}, "weightsManifest": [{"paths": ["model.weights.bin"], "weights": [{"name": "input/kernel", "shape": [5, 16], "dtype": "float32", "data": [0.1,0.2,...]}]}], "kerasVersion": "tfjs-layers 4.20.0"}